[
  {
    "id": 1,
    "title": "Hackathon DGTU",
    "image": "projects/img.png",
    "text": "Этот проект был создан на Хакатоне в Ростове. Здесь мы создали сайт, который определял эмоции людей, мог показать, какие конкретно эмоции они испытывают и насколько они сильны."
  },
  {
    "id": 2,
    "title": "Hackathon Cyber Garden",
    "image": "projects/img_1.png",
    "text": "Этот проект был создан на мероприятии «Хакатон» в Таганроге. Здесь мы создали Spa на VueJS и приложение для iPhone. Сервер был на Laravel. Моя часть работы заключалась в написании Spa на VueJs и получении данных с сервера. Приложение было создано, чтобы помочь людям с личным автомобилем поделиться им с другими за деньги."
  },
  {
    "id": 3,
    "title": "Duduk Market (Магазин духовых инструментов)",
    "image": "projects/img_2.png",
    "text": "Этот проект был моей курсовой работой на третьем курсе университета. Основной задачей было создание интернет-магазина духовых инструментов. Работа выполнена на фреймворке Django. Изначально дизайн-макет разрабатывался в Figma, а потом началось кодирование. Реализованы следующие функции: вывод товаров из базы, добавление товаров в корзину, удаление товаров из корзины, оформление заказа."
  },
  {
    "id": 4,
    "title": "Dental Care Center (Стоматологический кабинет)",
    "image": "projects/img_3.png",
    "link": "http://xn--26-6kc5aakcft.xn--p1ai/",
    "text": "Сайт стоматологической клиники в моём родном городе - Ставрополе."
  },
  {
    "id": 5,
    "title": "STE (СтильЭлит) - магазин одежды",
    "image": "projects/img_4.png",
    "text": "Многостраничное приложение для Беларусского магазина женской одежды. Стек: Вёрстка на самописном конфиге gulp с использованием всевозможных интересных плагинов, SCSS/PUG и т.д."
  },
  {
    "id": 6,
    "title": "Single Page Application (CSR)",
    "image": "projects/img_6.png",
    "link": "https://studyarabic.ru/#/",
    "text": "Сайт для языковой школы - г. Москва"
  },
  {
    "id": 7,
    "title": "Многостраничный сайт с CMS 1C:Bitrix",
    "image": "projects/img_7.png",
    "link": "https://spiefqatar.ru/",
    "text": "Сайт для участника международного форума. Особенности: Верстка с использованием современных инструментов (CSS Grid, CSS Flexbox, SVG). Стэк: HTML, CSS/SCSS, JS, Pug, Prepros."
  },
  {
    "id": 8,
    "title": "Многостраничный сайт - Онлайн кинотеатр (Web-версия)",
    "image": "projects/img_8.png",
    "link": "https://movix.ru/",
    "text": "Задача нашей команды состояла в вёрстке большого онлайн-кинотеатра. В стек проекта входил: наверное самый большой конфиг Gulp, который довелось увидеть. Помимо множества плагинов для использования Pug, PostCSS, JS модулей, линтеров, транспиляторов и пр., была реализована методика построения DOM-дерева внутри JSON файлов, используя переиспользуемые компоненты. Потом проект ушел на интеграцию с backend'ом"
  },
  {
    "id": 9,
    "title": "Praem Capital (SPA панель управления трейдинговыми ботами)",
    "image": "projects/img_10.jpg",
    "text": "Бот-панель: одностраничное приложение для управления трейдинг-ботами Praem Capital, а также для отслеживания статистики, истории транзакций ботов с возможностью регистрации нескольких биржевых аккаунтов. Вывод статистики в табличном и графическом представлении с использованием Vuetify, Apexcharts.\nСтэк: VueJS, Vue CLI, axios, vuex, vuetify, HTML, CSS/SCSS, JS, vue i18n, Vue Router, MomentJS, Vue Apexcharts"
  },
  {
    "id": 10,
    "title": "Praem Capital (Лэндинг)",
    "image": "projects/img_9.png",
    "text": "Лэндинг: Лэндинг с большим количеством анимации, возможность смены языка, использование стандартный JS функций для получения данных с сервера.\nСтэк: VueJS, JS, HTML, SCSS, vue i18n, axios, Vue CLI"
  },
  {
    "id": 11,
    "title": "Иммерсивный театр",
    "image": "projects/img_5.png",
    "text": "Стек:  Vue + Nuxt + Typescript, axios, SCSS"
  },
  {
    "id": 12,
    "title": "AvoQR Chrome Extension",
    "image": "projects/img_10.png",
    "link": "https://chrome.google.com/webstore/detail/avoqr/pocpbdnggkidofimbbdnbjigojinjfpe",
    "text": "AvoQR (Расширения для Google Chrome). Небольшое расширение для Google Chrome для создания конфигурируемых QR-кодов с закодированным URL текущей страницы или набранного текста. Личный небольшой проект."
  },
  {
    "id": 13,
    "title": "Ресторанная коллекция",
    "image": "projects/img_11.png",
    "link": "https://visa.aspirelifestyles.ru/",
    "text": "Многостраничный сайт - ресторанная коллекция. Стек: Gulp/SCSS/Sprite/Pug/jquery"
  }
]